#### TaskDialogIcon Enumeration

---

|  |
| --- |
| See Also |

Standard icons to be used in the task dialog.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public enum TaskDialogIcon ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration TaskDialogIcon ``` |

| Visual C++ |
| --- |
| ``` public enum class TaskDialogIcon ``` |

# Members

| Member name | Description |
| --- | --- |
| TaskDialogIconNone | No icon. |
| TaskDialogIconShield | Shield icon. |
| TaskDialogIconInformation | Information icon. |
| TaskDialogIconError | Error icon. |
| TaskDialogIconWarning | Warning icon. |

# See Also

Autodesk.Revit.UI Namespace